# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

# Binaries
brew 'bash'
brew 'bat'
brew 'curl'
brew 'ffmpeg'
brew 'getantibody/tap/antibody'
brew 'git'
brew 'grep'
brew 'eslint'
brew 'mackup'
brew 'mas'
brew 'neovim'
brew 'now-cli'
brew 'screenfetch'
brew 'trash'
brew 'tree'
brew 'typescript'
brew 'wifi-password'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'

# Fonts
cask 'font-hack'
cask 'font-inter'
cask 'font-liberation-mono-for-powerline'
cask 'font-public-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-roboto-mono'
cask 'font-roboto-mono-for-powerline'
cask 'font-roboto-slab'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-space-grotesk'
cask 'font-space-mono'
cask 'font-work-sans'

# Apps
cask '1password'
cask 'adobe-creative-cloud'
cask 'balenaetcher'
cask 'discord'
cask 'dozer'
cask 'figma'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iina'
cask 'iterm2'
cask 'homebrew/cask-drivers/logitech-options'
cask 'manta'
cask 'now'
cask 'paparazzi'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'workbench'

# Mac App Store
mas 'Disk Cleaner', id: 970246631
mas 'iA Writer', id: 775737590
mas 'iStat Menus', id: 1319778037
mas 'KakaoTalk', id: 869223134
mas 'Keynote', id: 409183694
mas 'Magnet', id: 441258766
mas 'Noizio', id: 928871589
mas 'SnippetsLab', id: 1006087419
mas 'Spark', id: 1176895641
