# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Binaries
brew 'bash'
brew 'bat'
brew 'curl'
brew 'ffmpeg'
brew 'gatsby-cli'
brew 'getantibody/tap/antibody'
brew 'git'
brew 'grep'
brew 'eslint'
brew 'mackup'
brew 'mas'
brew 'neovim'
brew 'now-cli'
brew 'prettier'
brew 'screenfetch'
brew 'trash'
brew 'tree'
brew 'typescript'
brew 'wifi-password'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'

# Fonts
cask 'font-hack'
cask 'font-inter'
cask 'font-liberation-mono-for-powerline'
cask 'font-public-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-roboto-mono'
cask 'font-roboto-mono-for-powerline'
cask 'font-roboto-slab'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-space-grotesk'
cask 'font-space-mono'
cask 'font-work-sans'

# Apps
cask '1password'
cask 'adobe-creative-cloud'
cask 'calibre'
cask 'discord'
cask 'dozer'
cask 'figma'
cask 'firefox'
cask 'framer'
cask 'garmin-express'
cask 'google-backup-and-sync'
cask 'iina'
cask 'iterm2'
cask 'keyboard-maestro'
cask 'karabiner-elements'
cask 'krisp'
cask 'homebrew/cask-drivers/logitech-options'
cask 'loom'
cask 'notion'
cask 'now'
cask 'plex'
cask 'sketch'
cask 'spotify'
cask 'sublime-text'
cask 'textexpander'
cask 'vidrio'
cask 'visual-studio-code'
cask 'workbench'
cask 'zeplin'
cask 'zotero'

# Mac App Store
mas 'Adguard for Safari', id: 1440147259
mas 'Are.na for Safari', id: 1497800947
mas 'Deliveries: a package tracker', id: 290986013
mas 'Disk Cleaner', id: 970246631
mas 'DuckDuckGo Privacy Essentials', id: 1482920575
mas 'ImageFinder for Safari', id: 1514863337
mas 'iStat Menus', id: 1319778037
mas 'Magnet', id: 441258766
mas 'npmhub', id: 1542090429
mas 'RightFont - font manager', id: 1475782381
mas 'RunCat', id: 1429033973
mas 'SnippetsLab', id: 1006087419
mas 'Slack', id: 803453959
mas 'Spark', id: 1176895641
mas 'Things 3', id: 904280696
mas 'Ulysses', id: 1225570693
