zsh-users/zsh-autosuggestions
zsh-users/zsh-completions
zsh-users/zsh-history-substring-search
zsh-users/zsh-syntax-highlighting

denysdovhan/spaceship-prompt
mafredri/zsh-async
junegunn/fzf
rupa/z
Tarrasch/zsh-bd
